/*
 * Напишите программу на C++, которая отобразит ваше имя и адрес
 * (можете указать фиктивные данные).
 *
 */

#include <iostream>

using namespace std;

int main()
{
    //system("cls");
    setlocale(0, "");
    cout << "АДРЕС\n";
    cout << "-------------------------------\n";
    cout << "Иванцов Андрей Александрович\n";
    cout << "183038 г. Мурманск, пр. Ленина\n\n";
    //system("pause");
}
