/*****************************************************************************
 *
 *  Глава 5. Упражнение 3.
 *
 *  Напишите программу, которая приглашает пользователя вводить числа. После 
 *  каждого введенного значения программа должна выдавать накопленную сумму 
 *  введенных значений. Программа должна завершаться при вводе 0. 
 *
 *****************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    #if OS_WIN == true 
        system("chcp 1251 > nul");
        system("cls");
    #else
        system("clear");
    #endif

    cout << "5.3 НАКОПЛЕННАЯ СУММА\n";
    cout << "-----------------------------------\n";
    cout << "Для окончания вычислений введите 0\n";

    double nomber{};
    double summa{};

    do
    {
        cout << "Накопленная сумма: " << summa << endl;
        cout << "Введите число    : "; cin >> nomber;

        summa += nomber;

    } while (nomber != 0.0);

    cout << "-----------------------------------\n\n";

    #if OS_WIN == true 
        system("pause");
    #endif 
}